# Домашнее задание к лекции "Библиотека Pandas"

## Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
## Я взял самый маленький, у сайта умопомрачительная скорость скачивания)

In [2]:
import pandas as pd

In [3]:
data1 = pd.read_csv('ratings.csv')
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [4]:
data1.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
rating_level = 5
data1 = data1[data1['rating'] >= rating_level]
data1.head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [6]:
data2 = pd.read_csv('movies.csv')
data2.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [7]:
data = data1.merge(data2, left_on = 'movieId', right_on = 'movieId', how = 'left')

In [8]:
rating_level = 5
data.groupby('title')['title'].agg(['count']).sort_values('count', ascending=False).head(1)

                                  count
title
Shawshank Redemption, The (1994)    153

## Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [9]:
data3 = pd.read_csv('power.csv')
data3.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [10]:
data3 = data3[(data3['country'] == 'Latvia') | (data3['country'] == 'Lithuania') | (data3['country'] == 'Estonia')]
data3 = data3[(data3['category'] == 4) | (data3['category'] == 12) | (['category'] == 21)]
data3 = data3[(data3['year'] >= 2005) & (data3['category'] <= 2010)]
data3 = data3[(data3['quantity'] >= 0)]
data3['quantity'].sum()

6689.0

## Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
```
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni
```

In [11]:
page_url1 = 'https://fortrader.org/quotes'

pd.read_html(page_url1)[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  91.77       0.88          0.97        NaN
1       USDRUB Курс рубля к доллару  76.26       0.29          0.38        NaN

In [12]:
pd.read_html(page_url1)[1]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,67.10,0.70,1.05,NaN
1,Нефть WTI Цены на нефть WTI,63.43,0.62,0.99,NaN
2,Природный газ Цена на природный газ,2.74,0.04,1.29,NaN
3,Кофе,131.50,1.95,1.51,NaN
4,Кукуруза,592.00,5.40,0.92,NaN
5,Соя,407.50,5.10,1.27,NaN
6,Хлопок,84.71,-0.32,-0.38,NaN

In [13]:
page_url2 = 'https://www.finanz.ru/valyuty/v-realnom-vremeni'

pd.read_html(page_url2, encoding='utf-8')[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 598,"0,8%",Nasdaq,14 052,"0,1%",Биткойн,56 975,"1,2%",USD/RUB,758685,"0,1%"
1,РТС,1 497,"1,5%",S&P500,4 185,"0,4%",Нефть,666,"-0,2%",EUR/RUB,909385,"0,1%"
2,Dow,34 201,"0,5%",FTSE100,7 020,"0,5%",Золото,1 778,"-0,1%",EUR/USD,11955,"-0,2%"